Revit 2026 API

# TextElementGetMaximumAllowedWidth(Document, ElementId) Method

---

Returns the maximum width the text element can be created with.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static double GetMaximumAllowedWidth(
	Document cdda,
	ElementId typeId
)
```
```vb
Public Shared Function GetMaximumAllowedWidth (
	cdda As Document,
	typeId As ElementId
) As Double
```
```cpp
public:
static double GetMaximumAllowedWidth(
	Document^ cdda,
	ElementId^ typeId
)
```
```fsharp
static member GetMaximumAllowedWidth :
        cdda : Document *
        typeId : ElementId -> float
```

#### Parameters

cdda Document
     A document containing the new text element's type
typeId ElementId
     Id of the text type

#### Return Value

Double The maximum allowed width in paper space [ft].

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Note that it is not necessarily a constant; it can be affected by properties of the text type, such as the width factor.

#### Reference

TextElement Class

GetMaximumAllowedWidth Overload

Autodesk.Revit.DB Namespace